import React from 'react';
import ObjectiveQuestion from "../comman/objectiveQuestion";
import SubjectiveQuestion from "../comman/subjectiveQuestion";

const DisplayObjectiveQuestions = (props) => {

    const {questions} = props

    return(
        <div style={{marginLeft:'10%', paddingTop:'50px'}}>
          <div>
            {
              questions.map((el, index) => (
                <ObjectiveQuestion 
                   key={index}              
                   question={el.question}
                   options={el.options}
                   rightOption={el.rightOption}
                />
              ))
            }
            </div>
            <div>
                <SubjectiveQuestion
                 question={`दूसरे विश्व युद्ध के बारे में लिखें`}
                 answer={` विश्व युद्ध II, अथवा द्वितीय विश्व युद्ध,[1] (इसको संक्षेप में WWII या WW2 लिखते हैं), ये एक वैश्विक सैन्य संघर्ष था जिसमें, सभी महान शक्तियों समेत दुनिया के 
                    अधिकांश देश शामिल थे, जो दो परस्पर विरोधी सैन्य गठबन्धनों में संगठित थे: मित्र राष्ट्र एवं धुरी राष्ट्र.इस युद्ध में 10 करोड़ से ज्यादा सैन्य कर्मी शामिल थे, इस वजह से ये 
                    इतिहास का सबसे व्यापक युद्ध माना जाता है।"पूर्ण युद्ध" की अवस्था में, प्रमुख सहभागियों ने नागरिक और सैन्य संसाधनों के बीच के अंतर को मिटा कर युद्ध प्रयास की सेवा में अपनी 
                    पूरी औद्योगिक, आर्थिक और वैज्ञानिक क्षमताओं को झोक दिया। इसमें सात करोड़ से अधिक लोग मारे गए थे, जिनमें से अधिकांश साधारण नागरिक थे, इसलिए इसको मानव इतिहास 
                    का सबसे खूनी संघर्ष माना जाता है। युद्ध की शुरुआत को आम तौर पर 1 सितम्बर 1939 माना जाता है, जर्मनी के पोलैंड के ऊपर आक्रमण करने और परिणामस्वरूप ब्रिटिश साम्राज्य और राष्ट्रमंडल के अधिकांश देशों और फ्रांस द्वारा जर्मनी पर युद्ध की घोषणा के साथ.[3][4] कई देश इस तारीख से पहले ही युद्धरत थे, अन्य घटनाओं के परिणामस्वरूप और कई जो शुरुआत में शामिल नहीं थे बाद में युद्ध में शामिल हो गए। युद्ध की कुछ मुख्य घटनाएँ हैं मार्को पोलो पुल हादसा (राष्ट्रवादी चीन और जापान के बीच लड़ा गया), ऑपरेशन बारबोसा (जर्मनी द्वारा सोविअत संघ पर आक्रमण) की शुरुआत और पर्ल हार्बर और ब्रिटिश औरडच कालोनियों पर दक्षिण पूर्व एशिया में हमला.
                    1945 में मित्र राष्ट्रों की विजय के साथ युद्ध समाप्त हो गया।सोवियत संघ और संयुक्त राज्य अमेरिका युद्ध के बाद दुनिया की महाशक्तियों के रूप में उभरे, जिससे शीत युद्ध की पृष्ठभूमि 
                    तैयार हुई, जो की अगले 45 वर्षों तक चली.संयुक्त राष्ट्र एक और ऐसे संघर्ष को रोकने की आशा में बनाया गया।आत्म निर्धारण की स्वीकृति ने एशिया और अफ्रीका में गैर उपनिवेशवाद आन्दोलनों 
                    को गति प्रदान की, जबकि पश्चिमी यूरोप स्वयं एकीकरण की ओर बढना शुरू हो गया।`}
                />
            </div>
        </div>
    )
}

export default DisplayObjectiveQuestions;